<?php require dirname(__DIR__) . "../../includes/bootstrap.php"; ?>

<title>Про сайт / Часті запитання</title>
<div class="modal-inner-content modal-inner-content-about" style="padding-bottom: 30px;">
    <div class="modal-inner-content-menu">
        <a href="/views/about.php" class="tdlink" title="Докладніше про цей веб-сайт!">Про сайт</a>
        <span>Часті запитання</span>
    </div>
    <div class="horizontal-line">&nbsp;</div>

    <h2>1. У мене є питання. З ким я можу зв'язатися?</h2>
    <p>
        Технічний адміністратор цього веб-сайту - <a href="mailto:<?php echo getWebsiteConfig('owner_email'); ?>"><?php echo getWebsiteConfig('owner_name'); ?></a>.
    </p>

    <h2>2. Що таке APRS?</h2>
    <p>
        APRS (Автоматична Пакетна Система Звітування) - це цифрова система зв'язку, яка використовує пакетне радіо для передачі тактичної інформації в реальному часі. Мережа APRS використовується радіоаматорами по всьому світу.
    </p>
    <p>
        Інформацію, що передається через мережу APRS, включає координати, висоту, швидкість, напрямок, текстові повідомлення, сповіщення, оголошення, бюлетені та погодні дані.
    </p>

    <h2>3. Що таке APRS Track Direct</h2>
    <p>
        Цей веб-сайт базується на інструментах APRS Track Direct. Докладніше читайте на <a href="https://github.com/qvarforth/trackdirect" target="_blank">GitHub</a>. Проте слід зазначити, що адміністратор APRS Track Direct не має жодного відношення до цього веб-сайту.
    </p>

    <h2>4. У мене є карта, створена в <a target="_blank" href="https://mymaps.google.com/">Google My Maps</a>. Чи можна її відобразити на цій карті?</h2>
    <p>
        Звісно! Дотримуйтесь таких інструкцій...
    </p>
    <ol>
        <li>Відкрийте свою карту на <a target="_blank" href="https://mymaps.google.com/">Google My Maps</a>.</li>
        <li>Подивіться поточну URL-адресу та спробуйте знайти значення під назвою <b>mid</b>. Скопіюйте це значення!</li>
        <li>Відкрийте цей веб-сайт. Додайте <b>"&mid={значення mid}"</b> в кінець URL-адреси.</li>
        <li>Натисніть Enter!</li>
    </ol>

    <h2>5. Мій останній пакет, схоже, використовує різні маршрути, в залежності від того, на якому веб-сайті я дивлюся (пов'язано з APRS-IS). Чому?</h2>
    <p>
        Веб-сайти, які ви порівнюєте, не збирають пакети з одних і тих самих серверів APRS-IS. Кожен сервер APRS-IS виконує фільтрацію дублікатів, і той пакет, який вважається дублікатом, може відрізнятися від одного сервера APRS-IS до іншого.
    </p>

    <h2>6. Звідки беруться відображені дані?</h2>
    <p>На кожній станції ви можете побачити вказаний джерело. Дані APRS можуть бути отримані з <a href="http://www.aprs-is.net" target="_blank">APRS-IS</a>, <a href="http://www.wxqa.com" target="_blank">CWOP-IS</a> або <a href="https://www.glidernet.org" target="_blank">OGN</a> (і інші).

    <h2>7. Як запобігти відображенню моїх даних на веб-сайтах, таких як цей?</h2>
    <h3>A. Відповідь для APRS-IS/CWOP-IS та інших</h3>
    <p>
        Якщо ви не хочете, щоб ваші дані APRS були опубліковані на веб-сайтах APRS, ви можете додати <b>NOGATE</b> в кінець вашого маршруту (або використовувати <b>RFONLY</b>). Якщо ваш маршрут діджипітера виглядає як <b>WIDE1-1,WIDE2-1</b>, ви просто змінюєте його на <b>WIDE1-1,WIDE2-1,NOGATE</b>.
    </p>

    <h3>B. Відповідь для OGN (Open Glider Network)</h3>
    <p>
        Не всі дані, які надсилаються до Open Glider Network, публікуються.
    </p>
    <p>
        Літаки, які задовольняють будь-який з наступних умов, зовсім не показуються.
        &rarr; Мають прапор "no-tracking" у конфігурації пристрою FLARM.
        &rarr; Активували налаштування "I don't want this device to be tracked" в базі даних пристроїв <a target="_blank" href="http://wiki.glidernet.org/ddb">OGN Devices DataBase</a>.
    </p>
    <p>
        Цей веб-сайт відображає лише інформацію, яка може бути використана для ідентифікації повітряного судна, якщо дані пристрою повітряного судна існують в базі даних <a target="_blank" href="http://wiki.glidernet.org/ddb">OGN Devices DataBase</a> та налаштування "I don't want this device to be identified" вимкнено. Якщо веб-сайт налаштований на відображення повітряних суден, які не існують в базі даних OGN, повітряному судну надається тимчасове ім'я, яке використовується лише протягом максимум 24 годин (щоб впевнитися, що його не можна ідентифікувати).
    </p>
    <p>
        Дізнайтеся більше про те, як "Opt In" або "Opt Out" <a target="_blank" href="http://wiki.glidernet.org/opt-in-opt-out">тут</a>.
    </p>

    <h2>8. Як створюється карта зони покриття?</h2>
    <p>
        Зверніть увагу, що карта покриття доступна лише для приймальних станцій і намагається показати з якої області станція може отримувати пакети.
    </p>
    <p>
        Карта покриття складається з двох частин:
    <ul>
        <li><span>Теплова карта, яка показує всі записані координати.</span></li>
        <li><span>Інтерпольований максимальний полігон покриття.</span></li>
    </ul>
    </p>
    <p>
        Максимальний полігон покриття створюється так:
    <ol>
        <li><span>Ми виключаємо позиції, які знаходяться на відстані далі, ніж 95-й персентиль.</span></li>
        <li><span>Ми використовуємо алгоритм об'ємного оболонки для отримання полігона покриття.</span></li>
        <li><span>Ми додаємо трохи додаткової площі до області з попереднього кроку. Цей крок використовується лише для поліпшення вигляду полігона.</span></li>
    </ol>
    </p>

    <h2>9. Як працює логіка відображення маркерів?</h2>
    <p>
        Добре, дозвольте мені розповісти більше про нашу блискучу логіку маркерів :-)
    </p>
    <ul>
        <li>У нас є фільтр обмеження швидкості та інші фільтри, які відсіюють пакети з відсутніми координатами.</li>
        <li>Якщо рухлива станція надсилає пакет, який відсіюється нашим фільтром обмеження швидкості, пакет буде позначений як непідтверджений. Якщо пізніше ми отримуємо пакет, який підтверджує рух станції в цьому напрямку, попередній пакет буде підтверджений.</li>
        <li>Якщо станція рухається в одній області і раптом з'являється в іншій області, дві траєкторії будуть з'єднані пунктирною полілінією.</li>
        <li>Рухаюча станція, яка вказує свою швидкість та напрямок, буде мати анімовану лінію напрямку (зникне після 15 хвилин).</li>
        <li>Пунктирна полілінія показує шлях передачі пакету, вона відображається, коли ви наводите курсор на маркер або "точковий маркер". Якщо станція в шляху не відправляла пакет з координатами дуже довго, вона відобразиться на деякий час і потім знову зникне.</li>
        <li>Зверніть увагу, що інтервал часу, вказаний у вікні інформації про станцію (на карті), вказує, як довго станція перебувала на цьому місці без жодних перерв тривалістю більше 24 годин.</li>
    </ul>

    <h2>10. Чи можна посилати посилання на цей веб-сайт?</h2>
        <p>
            Так, абсолютно!
        </p>
        <ul>
            <li>
                Щоб посилати посилання на карту станції, використовуйте один з наступних варіантів:
                <br/><span style="color:darkblue;">https://aprs.dead.guru?sname=<b>ІМ'Я-СТАНЦІЇ</b></span>
                <br/><span style="color:darkblue;">https://aprs.dead.guru?sid=<b>ІДЕНТИФІКАТОР-СТАНЦІЇ</b></span>
            </li>
            <br/>
            <li>
                Щоб посилати посилання на карту для кількох станцій, використовуйте один з наступних варіантів:
                <br/><span style="color:darkblue;">https://aprs.dead.guru?snamelist=<b>ІМ'Я-СТАНЦІЇ-1,ІМ'Я-СТАНЦІЇ-2,ІМ'Я-СТАНЦІЇ-3</b></span>
                <br/><span style="color:darkblue;">https://aprs.dead.guru?sidlist=<b>ІДЕНТИФІКАТОР-СТАНЦІЇ-1,ІДЕНТИФІКАТОР-СТАНЦІЇ-2,ІДЕНТИФІКАТОР-СТАНЦІЇ-3</b></span>
            </li>
            <br/>
            <li>
                Щоб надіслати посилання на карту, центровану на певній позиції, використовуйте наступне:
                <br/><span style="color:darkblue;">https://aprs.dead.guru?center=<b>ШИРОТА</b>,<b>ДОВГОТА</b>&zoom=<b>РІВЕНЬ-МАСШТАБУ</b></span>
            </li>

        </ul>

        <h2>11. Які браузери підтримує цей веб-сайт?</h2>
        <p>
            Нашою метою є те, щоб APRS Direct працював на всіх браузерах, які підтримують вебсокети (функція HTML5). Наступні версії браузера (і новіші) підтримують протокол вебсокетів.
        </p>
        <ul>
            <li>Internet Explorer 10 (випущено 4/9 2012)</li>
            <li>Edge 12 (випущено 30/3 2015)</li>
            <li>Firefox 11 (випущено 31/1 2012)</li>
            <li>Chrome 16 (випущено 25/10 2012)</li>
            <li>Safari 7 (випущено 22/10 2013)</li>
            <li>Opera 6.1 (випущено 5/11 2012)</li>
            <li>iOS Safari 6.1 (випущено 28/1 2013)</li>
            <li>Android Browser 4.4 (випущено 9/12 2013)</li>
            <li>Blackberry browser 7 (випущено 1/1 2012)</li>
            <li>Opera Mobile 12.1 (випущено 9/10 2012)</li>
            <li>Chrome 53 для Android (випущено 8/9 2016)</li>
            <li>Firefox 49 для Android (випущено 20/9 2016)</li>
            <li>IE Mobile 10 (випущено 20/6 2012)</li>
            <li>UC Browser 11 (випущено 17/8 2016)</li>
            <li>Samsung Internet 4 (випущено 19/4 2016)</li>
        </ul>
</div>